__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 448)  0                                            
__________________________________________________________________________________________________
gaussian_noise_1 (GaussianNoise (None, 32, 32, 448)  0           input_1[0][0]                    
__________________________________________________________________________________________________
reflection_padding2d_1 (Reflect (None, 34, 34, 448)  0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
reflection_padding2d_5 (Reflect (None, 34, 34, 448)  0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
reflection_padding2d_9 (Reflect (None, 34, 34, 448)  0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
reflection_padding2d_13 (Reflec (None, 34, 34, 448)  0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
reflection_padding2d_17 (Reflec (None, 34, 34, 448)  0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
reflection_padding2d_21 (Reflec (None, 34, 34, 448)  0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
reflection_padding2d_25 (Reflec (None, 34, 34, 448)  0           gaussian_noise_1[0][0]           
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 32, 32, 32)   129056      reflection_padding2d_1[0][0]     
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 32, 32, 32)   129056      reflection_padding2d_5[0][0]     
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 32)   129056      reflection_padding2d_9[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 32, 32, 32)   129056      reflection_padding2d_13[0][0]    
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 32, 32, 32)   129056      reflection_padding2d_17[0][0]    
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 32, 32, 32)   129056      reflection_padding2d_21[0][0]    
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 32, 32, 32)   129056      reflection_padding2d_25[0][0]    
__________________________________________________________________________________________________
elu_1 (ELU)                     (None, 32, 32, 32)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
elu_4 (ELU)                     (None, 32, 32, 32)   0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
elu_7 (ELU)                     (None, 32, 32, 32)   0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
elu_10 (ELU)                    (None, 32, 32, 32)   0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
elu_13 (ELU)                    (None, 32, 32, 32)   0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
elu_16 (ELU)                    (None, 32, 32, 32)   0           conv2d_21[0][0]                  
__________________________________________________________________________________________________
elu_19 (ELU)                    (None, 32, 32, 32)   0           conv2d_25[0][0]                  
__________________________________________________________________________________________________
reflection_padding2d_2 (Reflect (None, 34, 34, 32)   0           elu_1[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_6 (Reflect (None, 34, 34, 32)   0           elu_4[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_10 (Reflec (None, 34, 34, 32)   0           elu_7[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_14 (Reflec (None, 34, 34, 32)   0           elu_10[0][0]                     
__________________________________________________________________________________________________
reflection_padding2d_18 (Reflec (None, 34, 34, 32)   0           elu_13[0][0]                     
__________________________________________________________________________________________________
reflection_padding2d_22 (Reflec (None, 34, 34, 32)   0           elu_16[0][0]                     
__________________________________________________________________________________________________
reflection_padding2d_26 (Reflec (None, 34, 34, 32)   0           elu_19[0][0]                     
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 32)   9248        reflection_padding2d_2[0][0]     
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 32, 32, 32)   9248        reflection_padding2d_6[0][0]     
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 32)   9248        reflection_padding2d_10[0][0]    
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 32, 32, 32)   9248        reflection_padding2d_14[0][0]    
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 32, 32, 32)   9248        reflection_padding2d_18[0][0]    
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 32, 32, 32)   9248        reflection_padding2d_22[0][0]    
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 32, 32, 32)   9248        reflection_padding2d_26[0][0]    
__________________________________________________________________________________________________
elu_2 (ELU)                     (None, 32, 32, 32)   0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
elu_5 (ELU)                     (None, 32, 32, 32)   0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
elu_8 (ELU)                     (None, 32, 32, 32)   0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
elu_11 (ELU)                    (None, 32, 32, 32)   0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
elu_14 (ELU)                    (None, 32, 32, 32)   0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
elu_17 (ELU)                    (None, 32, 32, 32)   0           conv2d_22[0][0]                  
__________________________________________________________________________________________________
elu_20 (ELU)                    (None, 32, 32, 32)   0           conv2d_26[0][0]                  
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 32)   0           elu_2[0][0]                      
                                                                 elu_1[0][0]                      
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 32)   0           elu_5[0][0]                      
                                                                 elu_4[0][0]                      
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 32, 32)   0           elu_8[0][0]                      
                                                                 elu_7[0][0]                      
__________________________________________________________________________________________________
add_4 (Add)                     (None, 32, 32, 32)   0           elu_11[0][0]                     
                                                                 elu_10[0][0]                     
__________________________________________________________________________________________________
add_5 (Add)                     (None, 32, 32, 32)   0           elu_14[0][0]                     
                                                                 elu_13[0][0]                     
__________________________________________________________________________________________________
add_6 (Add)                     (None, 32, 32, 32)   0           elu_17[0][0]                     
                                                                 elu_16[0][0]                     
__________________________________________________________________________________________________
add_7 (Add)                     (None, 32, 32, 32)   0           elu_20[0][0]                     
                                                                 elu_19[0][0]                     
__________________________________________________________________________________________________
reflection_padding2d_3 (Reflect (None, 34, 34, 32)   0           add_1[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_7 (Reflect (None, 34, 34, 32)   0           add_2[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_11 (Reflec (None, 34, 34, 32)   0           add_3[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_15 (Reflec (None, 34, 34, 32)   0           add_4[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_19 (Reflec (None, 34, 34, 32)   0           add_5[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_23 (Reflec (None, 34, 34, 32)   0           add_6[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_27 (Reflec (None, 34, 34, 32)   0           add_7[0][0]                      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 7)    2023        reflection_padding2d_3[0][0]     
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 32, 32, 7)    2023        reflection_padding2d_7[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 32, 32, 7)    2023        reflection_padding2d_11[0][0]    
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 32, 32, 7)    2023        reflection_padding2d_15[0][0]    
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 32, 32, 7)    2023        reflection_padding2d_19[0][0]    
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 32, 32, 7)    2023        reflection_padding2d_23[0][0]    
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 32, 32, 7)    2023        reflection_padding2d_27[0][0]    
__________________________________________________________________________________________________
elu_3 (ELU)                     (None, 32, 32, 7)    0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
elu_6 (ELU)                     (None, 32, 32, 7)    0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
elu_9 (ELU)                     (None, 32, 32, 7)    0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
elu_12 (ELU)                    (None, 32, 32, 7)    0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
elu_15 (ELU)                    (None, 32, 32, 7)    0           conv2d_19[0][0]                  
__________________________________________________________________________________________________
elu_18 (ELU)                    (None, 32, 32, 7)    0           conv2d_23[0][0]                  
__________________________________________________________________________________________________
elu_21 (ELU)                    (None, 32, 32, 7)    0           conv2d_27[0][0]                  
__________________________________________________________________________________________________
reflection_padding2d_4 (Reflect (None, 34, 34, 7)    0           elu_3[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_8 (Reflect (None, 34, 34, 7)    0           elu_6[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_12 (Reflec (None, 34, 34, 7)    0           elu_9[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_16 (Reflec (None, 34, 34, 7)    0           elu_12[0][0]                     
__________________________________________________________________________________________________
reflection_padding2d_20 (Reflec (None, 34, 34, 7)    0           elu_15[0][0]                     
__________________________________________________________________________________________________
reflection_padding2d_24 (Reflec (None, 34, 34, 7)    0           elu_18[0][0]                     
__________________________________________________________________________________________________
reflection_padding2d_28 (Reflec (None, 34, 34, 7)    0           elu_21[0][0]                     
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 7)    448         reflection_padding2d_4[0][0]     
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 7)    448         reflection_padding2d_8[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 32, 32, 7)    448         reflection_padding2d_12[0][0]    
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 32, 32, 7)    448         reflection_padding2d_16[0][0]    
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 32, 32, 7)    448         reflection_padding2d_20[0][0]    
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 32, 32, 7)    448         reflection_padding2d_24[0][0]    
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 32, 32, 7)    448         reflection_padding2d_28[0][0]    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 32, 32, 49)   0           conv2d_4[0][0]                   
                                                                 conv2d_8[0][0]                   
                                                                 conv2d_12[0][0]                  
                                                                 conv2d_16[0][0]                  
                                                                 conv2d_20[0][0]                  
                                                                 conv2d_24[0][0]                  
                                                                 conv2d_28[0][0]                  
==================================================================================================
Total params: 985,425
Trainable params: 985,425
Non-trainable params: 0
__________________________________________________________________________________________________
